PERFORM VARYING WS-COUNTER FROM 1 BY 1 UNTIL WS-COUNTER > 100
    IF WS-COUNTER > 50 THEN
        CONTINUE
    END-IF
    . 
    . 
    . 
END-PERFORM.